docs/site/stockhausen96_elect_perfor_pract.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>stockhausen96_elect_perfor_pract</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">stockhausen96_elect_perfor_pract</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#stockhausen96_elect_perfor_pract">Electroacoustic Performance Practice</a>
<ul>
<li><a href="#orgdcaf920">Importance of Recording</a></li>
<li><a href="#orge841921">Quality</a></li>
<li><a href="#orgb819447">Halls</a></li>
<li><a href="#orgef6631f">Prefabricated</a></li>
<li><a href="#org547065f">Education</a></li>
<li><a href="#org3ec722e">State of Traditional Music</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-stockhausen96_elect_perfor_pract" class="outline-2">
<h2 id="stockhausen96_elect_perfor_pract">Electroacoustic Performance Practice</h2>
<div class="outline-text-2" id="text-stockhausen96_elect_perfor_pract">
</div>
<div id="outline-container-orgdcaf920" class="outline-3">
<h3 id="orgdcaf920">Importance of Recording</h3>
<div class="outline-text-3" id="text-orgdcaf920">
<p>
Every musician should be responsible for knowing how their instrument should be recorded. It is as important as knowing how to play it. This also crosses over into live electroacoustic music for understanding mic placement.
</p>
</div>
</div>
<div id="outline-container-orge841921" class="outline-3">
<h3 id="orge841921">Quality</h3>
<div class="outline-text-3" id="text-orge841921">
<p>
The modern recording techniques allow for greater exactness, balance, etc. than a live group can acheive in live performance.
</p>
</div>
</div>
<div id="outline-container-orgb819447" class="outline-3">
<h3 id="orgb819447">Halls</h3>
<div class="outline-text-3" id="text-orgb819447">
<p>
Halls are built for performance of traditional music. They are not designed for electroacoustic music.
</p>
</div>
</div>
<div id="outline-container-orgef6631f" class="outline-3">
<h3 id="orgef6631f">Prefabricated</h3>
<div class="outline-text-3" id="text-orgef6631f">
<p>
Prefab music is very important because it is usually of the highest quality, and brings sound worlds that could never be created with familiar sound sources.
</p>
</div>
</div>
<div id="outline-container-org547065f" class="outline-3">
<h3 id="org547065f">Education</h3>
<div class="outline-text-3" id="text-org547065f">
<p>
Many musicians don't like the new technology. He claims this is schizophrenia, as we use the new tech in almost all other areas of life. Musicians should be interested in expanding their timbres.
</p>
</div>
</div>
<div id="outline-container-org3ec722e" class="outline-3">
<h3 id="org3ec722e">State of Traditional Music</h3>
<div class="outline-text-3" id="text-org3ec722e">
<p>
Traditional instrumentarium is at an end. It will be preserved by the best soloists like Japanese Gagaku performers, or other small groups. They will preserve the art as timeless, but only the best can do that. There should be much effort to renew music study and incorporate what modern technology brings so we can produce more original sound worlds, more coordinated, coherent, balanced, adventuresome, mysterious, and fanciful music. All to serve beauty.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
